schedule_data = {
    "Понедельник": [
        ("Математика", "Тема: Рациональные дроби"),
        ("Программирование", "Тема: Введение в Python"),
        ("", ""), ("", "")
    ],
    "Вторник": [
        ("Физика", "Тема: Законы Ньютона"),
        ("История", "Тема: Средневековье"),
        ("", ""), ("", "")
    ],
    "Среда": [
        ("Английский", "Тема: Present Simple"),
        ("Химия", "Тема: Вода и её свойства"),
        ("", ""), ("", "")
    ],
    "Четверг": [
        ("Литература", "Тема: Романтизм"),
        ("География", "Тема: Реки мира"),
        ("", ""), ("", "")
    ],
    "Пятница": [
        ("Музыка", "Тема: Классическая музыка"),
        ("Физкультура", "Тема: Техника бега"),
        ("", ""), ("", "")
    ]
}
